src/cf/Documents/ВыплатыСамозанятым.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыплатыСамозанятым</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПрочимиКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетаУчетаЗатратВТаблице</Name>
					<Comment>АПК:58 Документ перенесен из БП</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаВТаблице</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>АПК:58 Документ перенесен из БП</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Comment>АПК:58 Документ перенесен из БП</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Выплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>АПК:58 Документ перенесен из БП</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>АПК:58 Документ перенесен из БП</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаЧек</Name>
							<Comment>Ссылка на чек на сайте ФНС</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧека</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧекСамозанятого</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВыплатыСамозанятымПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПричиныОтказаВЧекахВыплатСамозанятым</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаРезультата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/РасчетыСПрочимиКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПрочимиКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СодержаниеПроводки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Comment>АПК:1208</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыПлатежногоПоручения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоступленияПоСчету</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетаФактуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеДСПлан</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходДСПлан</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыДокументовВыплатыСамозанятым.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовВыплатыСамозанятым</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЗагружены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЧастичноЗагружены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ВыплатыСамозанятым/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	Возврат;
КонецПроцедуры

#КонецОбласти

// Возвращает табличный документ с реестром выплаты самозанятым для дальнейшей выгрузки в Excel
//
// Параметры:
//  Ссылка - Документы.ВыплатыСамозанятым - Ссылка на документ, для которого следует подготовить реестр
//
// Возвращаемое значение:
//  ТабличныйДокумент - Табличный документ с реестром.
//
Функция РеестрДляВыгрузкиВExcel(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыплатыСамозанятым.Дата КАК Дата,
	|	ВыплатыСамозанятым.Организация КАК Организация,
	|	ВыплатыСамозанятым.УслугаВТаблице КАК УслугаВТаблице,
	|	ВыплатыСамозанятым.Номенклатура КАК Номенклатура,
	|	ВыплатыСамозанятым.Выплаты.(
	|		Контрагент КАК Контрагент,
	|		БанковскийСчет КАК БанковскийСчет,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		Номенклатура КАК Номенклатура,
	|		Содержание КАК Содержание,
	|		НомерСтроки КАК НомерСтроки
	|	) КАК Выплаты
	|ИЗ
	|	Документ.ВыплатыСамозанятым КАК ВыплатыСамозанятым
	|ГДЕ
	|	ВыплатыСамозанятым.Ссылка = &Ссылка";
		
	ВыборкаДокумент = Запрос.Выполнить().Выбрать();
	Если Не ВыборкаДокумент.Следующий() Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
	Результат = Новый ТабличныйДокумент;
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.КлючПараметровПечати = "Документ.ВыплатыСамозанятым.РеестрВыплатСамозанятымДляВыгрузкиВExcel";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыплатыСамозанятым.РеестрВыплатСамозанятымДляВыгрузкиВExcel");
	
	ОбластиМакета = Новый Структура("ШапкаТаблицы, Строка");
	Для Каждого ОписаниеОбласти Из ОбластиМакета Цикл
		ОбластиМакета[ОписаниеОбласти.Ключ] = Макет.ПолучитьОбласть(ОписаниеОбласти.Ключ);
	КонецЦикла;
	
	// Шапка таблицы
	Результат.Вывести(ОбластиМакета.ШапкаТаблицы);
	
	// Строки таблицы
	ИнформацияОСодержании = Новый Структура;
	УслугаВТаблице = ВыборкаДокумент.УслугаВТаблице;
	Если Не УслугаВТаблице Тогда
		ПараметрыОбъекта = Новый Структура;
		ПараметрыОбъекта.Вставить("Дата", ВыборкаДокумент.Дата);
		ПараметрыОбъекта.Вставить("Организация", ВыборкаДокумент.Организация);
		
		НаименованиеПолное = ОбщегоНазначения.ЗначениеРеквизитаОбъекта( ВыборкаДокумент.Номенклатура, "НаименованиеПолное");
		ИнформацияОСодержании.Вставить("Содержание", Лев(НаименованиеПолное, 100));
	КонецЕсли;
	ВыборкаСтрок = ВыборкаДокумент.Выплаты.Выбрать();
	Пока ВыборкаСтрок.Следующий() Цикл
		ОбластиМакета.Строка.Параметры.Заполнить(ВыборкаСтрок);
		Если Не УслугаВТаблице Тогда
			ОбластиМакета.Строка.Параметры.Заполнить(ИнформацияОСодержании);
		КонецЕсли;
		СведенияОКонтрагенте = ПечатьДокументовУНФ.СведенияОЮрФизЛице(
			ВыборкаСтрок.Контрагент,
			ВыборкаДокумент.Дата,
			,
			ВыборкаСтрок.БанковскийСчет);
		ОбластиМакета.Строка.Параметры.Заполнить(СведенияОКонтрагенте);
		
		ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(СведенияОКонтрагенте.ПолноеНаименование);
		ФИОКонтрагента = Новый Структура;
		ФИОКонтрагента.Вставить("Фамилия",  ЧастиИмени.Фамилия);
		ФИОКонтрагента.Вставить("Имя",      ЧастиИмени.Имя);
		ФИОКонтрагента.Вставить("Отчество", ЧастиИмени.Отчество);
		ОбластиМакета.Строка.Параметры.Заполнить(ФИОКонтрагента);
		Результат.Вывести(ОбластиМакета.Строка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

// Сохраняет файл с реестром в формате CSV
//
// Параметры:
//  ИмяФайла - Строка - Имя временного файла
//  Ссылка - Документы.ВыплатыСамозанятым - Ссылка на документ, для которого следует подготовить реестр
//
Процедура СохранитьРеестрДляВыгрузкиВCSV(ИмяФайла, Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыплатыСамозанятым.Дата КАК Дата,
	|	ВыплатыСамозанятым.Организация КАК Организация,
	|	ВыплатыСамозанятым.СчетОрганизации КАК СчетОрганизации,
	|	ВыплатыСамозанятым.УслугаВТаблице КАК УслугаВТаблице,
	|	ВыплатыСамозанятым.Номенклатура КАК Номенклатура,
	|	ВыплатыСамозанятым.Выплаты.(
	|		Контрагент КАК Контрагент,
	|		БанковскийСчет КАК БанковскийСчет,
	|		Номенклатура КАК Номенклатура,
	|		Содержание КАК Содержание,
	|		Сумма КАК Сумма
	|	) КАК Выплаты
	|ИЗ
	|	Документ.ВыплатыСамозанятым КАК ВыплатыСамозанятым
	|ГДЕ
	|	ВыплатыСамозанятым.Ссылка = &Ссылка";
		
	ВыборкаДокумент = Запрос.Выполнить().Выбрать();
	Если Не ВыборкаДокумент.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8);
	УслугаВТаблице = ВыборкаДокумент.УслугаВТаблице;
	Если Не УслугаВТаблице Тогда
		ПараметрыОбъекта = Новый Структура;
		ПараметрыОбъекта.Вставить("Дата", ВыборкаДокумент.Дата);
		ПараметрыОбъекта.Вставить("Организация", ВыборкаДокумент.Организация);
		
		НаименованиеПолное = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДокумент.Номенклатура, "НаименованиеПолное");
		Содержание = Лев(НаименованиеПолное, 100);
	КонецЕсли;
	
	// Строки таблицы
	ВыборкаСтрок = ВыборкаДокумент.Выплаты.Выбрать();
	Пока ВыборкаСтрок.Следующий() Цикл
		СведенияОКонтрагенте = ПечатьДокументовУНФ.СведенияОЮрФизЛице(
			ВыборкаСтрок.Контрагент,
			ВыборкаДокумент.Дата,
			,
			ВыборкаСтрок.БанковскийСчет);
		ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(СведенияОКонтрагенте.ПолноеНаименование);
		Если УслугаВТаблице Тогда
			Содержание = ВыборкаСтрок.Содержание;
		КонецЕсли;
		
		// В выгрузке должна быть строка вида - "Счет (20 знаков);Фамилия;Имя;Отчество;Сумма (разделитель - точка);
		// Сумма произведенных удержаний (разделитель - точка);Наименование товаров и услуг в чеке (СМЗ)
		МассивПодСтрок = Новый Массив;
		МассивПодСтрок.Добавить(СведенияОКонтрагенте.НомерСчета);
		МассивПодСтрок.Добавить(ЧастиИмени.Фамилия);
		МассивПодСтрок.Добавить(ЧастиИмени.Имя);
		МассивПодСтрок.Добавить(ЧастиИмени.Отчество);
		МассивПодСтрок.Добавить(Формат(ВыборкаСтрок.Сумма, "ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
		МассивПодСтрок.Добавить(Формат(0, "ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0")); // Сумма удержаний для СМЗ всегда 0
		МассивПодСтрок.Добавить(Содержание);
		
		ЗаписьТекста.ЗаписатьСтроку(СтрСоединить(МассивПодСтрок, ";"));
		
	КонецЦикла;
	
	ЗаписьТекста.Закрыть();
	
КонецПроцедуры 

// Получает описание предопределенных наборов свойств.
//
// Параметры:
//  Наборы - ДеревоЗначений - с колонками:
//     * Имя           - Строка - Имя набора свойств. Формируется из полного имени объекта
//                       метаданных заменой символа "." на "_".
//                       Например, "Документ_ЗаказПокупателя".
//     * Идентификатор - УникальныйИдентификатор - Идентификатор ссылки предопределенного элемента.
//     * Используется  - Неопределено, Булево - Признак того, что набор свойств используется.
//                       Например, можно использовать для скрытия набора по функциональным опциям.
//                       Значение по умолчанию - Неопределено, соответствует значению Истина.
//     * ЭтоГруппа     - Булево - Истина, если набор свойств является группой.
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ВыплатыСамозанятым";
	Набор.Идентификатор = Новый УникальныйИдентификатор("8c406acb-0821-4319-8aa7-11e7185778e8");
	Набор.Используется  = ПолучитьФункциональнуюОпцию("ИспользоватьВыплатыСамозанятым");
	
КонецПроцедуры

// Возвращает реестр выплат самозанятым по сумме для подбора в банковские документы
//
// Параметры:
//  Сумма - Число - Сумма, на которую нужно найти реестр выплат самозанятым
//  Организация - Справочники.Организации - Организация, по которой следует найти реестр выплат самозанятым
//  ДатаДокумента - Дата - Дата документа оплаты
//  МассивРанееВыбранныхРеестров - Массив, Неопределено - Массив ранее выбранных реестров
//
// Возвращаемое значение:
//  Документы.ВыплатыСамозанятым - Ссылка на документ, который найден по сумме.
//
Функция РеестрВыплатСамозанятымПоСумме(Сумма, Организация, ДатаДокумента, МассивРанееВыбранныхРеестров = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сумма", Сумма);
	Если МассивРанееВыбранныхРеестров = Неопределено Тогда
		МассивРанееВыбранныхРеестров = Новый Массив;
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивРанееВыбранныхРеестров", МассивРанееВыбранныхРеестров);
	Если НачалоДня(ДатаДокумента) = ДатаДокумента Тогда
		Запрос.УстановитьПараметр("Период", КонецДня(ДатаДокумента));
	Иначе
		Запрос.УстановитьПараметр("Период", Новый Граница(ДатаДокумента, ВидГраницы.Исключая));
	КонецЕсли;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадолженностьСамозанятыхПоРееструОстатки.Документ КАК РеестрВыплатыСамозанятым
	|ПОМЕСТИТЬ ВТ_РеестрыКОплате
	|ИЗ
	|	РегистрНакопления.РасчетыСПрочимиКонтрагентами.Остатки(&Период, Организация = &Организация) КАК ЗадолженностьСамозанятыхПоРееструОстатки
	|ГДЕ
	|	ЗадолженностьСамозанятыхПоРееструОстатки.СуммаОстаток = &Сумма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_РеестрыКОплате.РеестрВыплатыСамозанятым КАК РеестрВыплатыСамозанятым
	|ИЗ
	|	ВТ_РеестрыКОплате КАК ВТ_РеестрыКОплате
	|ГДЕ
	|	НЕ ВТ_РеестрыКОплате.РеестрВыплатыСамозанятым В (&МассивРанееВыбранныхРеестров)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Документы.ВыплатыСамозанятым.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.РеестрВыплатыСамозанятым;
	
КонецФункции

// Возвращает ссылку на документ оплаты реестра выплаты самозанятым.
//
// Параметры:
//  Ссылка - ДокументСсылка.ВыплатыСамозанятым - Реестр выплат самозанятым, для которого следует определить документ оплаты
//
// Возвращаемое значение:
//  Документы.РасходСоСчета, Неопределено - Ссылка на документ, которым была произведена оплата
//
Функция ДокументОплаты(Ссылка) Экспорт
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВыплатыСамозанятым", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РасходСоСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходСоСчета КАК РасходСоСчета
	|ГДЕ
	|	РасходСоСчета.РеестрВыплатСамозанятым = &ВыплатыСамозанятым
	|	И НЕ РасходСоСчета.ПометкаУдаления
	|	И РасходСоСчета.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает статус загрузки чеков для отображения в документах оплаты.
//
// Параметры:
//  Ссылка - ДокументСсылка.ВыплатыСамозанятым - Реестр выплат самозанятым, для которого следует определить документ оплаты
//
// Возвращаемое значение:
//  Строка - Статус загрузки чеков, варианты ответа "", СтатусНеВсеЧекиЗагружены() или СтатусЧекиЗагружены() 
//
Функция СтатусЗагрузкиЧеков(Ссылка) Экспорт
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат "";
	КонецЕсли;
		
	// Если у документа был статус "Чеки загружены", то пользователь мог вручную очистить данные по чекам,
	//  поэтому нужно заново проверить загрузку чеков
	// Если же у документа еще не было статуса, то тем более нужно проверить загрузку чеков
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ВыплатыСамозанятымВыплаты.ЧекСамозанятого <> ЗНАЧЕНИЕ(Справочник.ВыплатыСамозанятымПрисоединенныеФайлы.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗагруженныеЧеки,
	|	СУММА(ВЫБОР
	|			КОГДА ВыплатыСамозанятымВыплаты.ЧекСамозанятого = ЗНАЧЕНИЕ(Справочник.ВыплатыСамозанятымПрисоединенныеФайлы.ПустаяСсылка)
	|					И ВыплатыСамозанятымВыплаты.НомерЧека <> """"
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеПрикрепленныеЧеки,
	|	СУММА(1) КАК ВсегоСтрок
	|ИЗ
	|	Документ.ВыплатыСамозанятым.Выплаты КАК ВыплатыСамозанятымВыплаты
	|ГДЕ
	|	ВыплатыСамозанятымВыплаты.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если (Выборка.ЗагруженныеЧеки <> NULL) И (Выборка.ВсегоСтрок <> NULL) Тогда
		Если Выборка.ЗагруженныеЧеки > 0 И Выборка.ЗагруженныеЧеки = Выборка.ВсегоСтрок Тогда
			Возврат СтатусЧекиЗагружены();		
		ИначеЕсли Выборка.ЗагруженныеЧеки > 0 Тогда
			// Есть загруженные чеки, но загружены не все
			Возврат СтатусНеВсеЧекиЗагружены();
		ИначеЕсли Выборка.НеПрикрепленныеЧеки = Выборка.ВсегоСтрок Тогда
			Возврат СтатусЧекиНеПрикреплены();
		Иначе
			// Чеки не загружены совсем или документ в статусе Отменен
			СтруктураСтатусаДокумента = РегистрыСведений.СтатусыДокументов.ПолучитьСтатусыДокумента(Ссылка, Неопределено);
			Если СтруктураСтатусаДокумента.Статус = Перечисления.СтатусыДокументовВыплатыСамозанятым.Отклонено Тогда
				Возврат СтатусРеестрВыплатОтменен();
			Иначе
				Возврат "";
			КонецЕсли;
		КонецЕсли;
	Иначе
		// Чеки не загружены совсем
		Возврат "";
	КонецЕсли;
		
КонецФункции 

// Устанавливает состояние документа в зависимости от данных в документе или переданного СостояниеДокумента
//
// Параметры:
//  Документ  - ДокументСсылка.ВыплатыСамозанятым - ссылка на документ, в котором нужно установить состояние
//
Процедура УстановитьСостояниеДокумента(Документ) Экспорт
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Документ, 
		"Организация, Проведен");
	ДокументПроведен = РеквизитыДокумента.Проведен;
	
	// Для получения статуса документа нельзя использовать процедуру
	// РегистрыСведений.СтатусыДокументов.ПолучитьСтатусыДокументов(...)
	// т.к. для нового документа, она вернет нам статус "Подготовлено", хотя по факту такой статус еще не установлен
	// Поэтому используем запрос
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Документ);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияБанковскихДокументов.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыДокументов КАК СостоянияБанковскихДокументов
	|ГДЕ
	|	СостоянияБанковскихДокументов.Документ = &Документ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ТекущийСтатус = Неопределено;
	ТекущийСтатус = ?(Выборка.Следующий(), Выборка.Статус, ТекущийСтатус);
	
	// Если документ в статусе Отклонен, то другие статусы уже присваивать нельзя.
	Если (ТекущийСтатус = Перечисления.СтатусыДокументовВыплатыСамозанятым.Отклонено) Тогда
		Возврат;
	КонецЕсли;
	
	НовыеСтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
	СтатусЗагрузкиЧеков = СтатусЗагрузкиЧеков(Документ);
	Если (ТекущийСтатус = Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЗагружены) И (СтатусЗагрузкиЧеков = "ЧекиЗагружены") Тогда
		Возврат;
	КонецЕсли;
	Если (ТекущийСтатус = Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЧастичноЗагружены) И (СтатусЗагрузкиЧеков = "НеВсеЧекиЗагружены") Тогда
		Возврат;
	КонецЕсли;
	Если (СтатусЗагрузкиЧеков = "ЧекиЗагружены") 
		И (ТекущийСтатус <> Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЗагружены) Тогда
		НовыеСтатусыДокумента.Статус = Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЗагружены;
		РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокумента(Документ, НовыеСтатусыДокумента);
	ИначеЕсли (СтатусЗагрузкиЧеков = "НеВсеЧекиЗагружены") 
		И (ТекущийСтатус <> Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЧастичноЗагружены) Тогда
		НовыеСтатусыДокумента.Статус = Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЧастичноЗагружены;
		РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокумента(Документ, НовыеСтатусыДокумента);
	ИначеЕсли ТекущийСтатус = Неопределено Тогда
		// Сохраним статус самостоятельно, т.к. процедура
		// РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокумента(...)
		// не может установить для документа статус по умолчанию = "Подготовлено"
		ЗаписатьСостояние(Документ, РеквизитыДокумента.Организация, Перечисления.СтатусыДокументовВыплатыСамозанятым.Подготовлено);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает признак, что есть неоплаченные реестры самозанятых.
//
// Параметры:
//  Организация - Справочники.Организации - Организация, по которой следует определить реестр выплат самозанятым
//
// Возвращаемое значение:
//  Булево - Признак, что есть неоплаченные реестры самозанятых 
//
Функция ЕстьНеоплаченныеРеестрыСамозанятых(Организация) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВыплатыСамозанятым") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадолженностьСамозанятыхПоРееструОстатки.Документ КАК РеестрВыплатыСамозанятым
	|ИЗ
	|	РегистрНакопления.РасчетыСПрочимиКонтрагентами.Остатки(, Организация = &Организация) КАК ЗадолженностьСамозанятыхПоРееструОстатки
	|ГДЕ
	|	ЗадолженностьСамозанятыхПоРееструОстатки.СуммаОстаток < 0
	|	И НЕ ВЫРАЗИТЬ(ЗадолженностьСамозанятыхПоРееструОстатки.Документ КАК Документ.ВыплатыСамозанятым) ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции

// Возвращает время документа по умолчанию.
// 
// Возвращаемое значение:
//  Структура - Часы, Минуты
Функция ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 9, 0);
	
КонецФункции

// Возвращает реестры выплат самозанятым по самозанятому для подбора в банковские документы
//
// Параметры:
//  Самозанятый - Справочники.Контрагенты - Самозанятый, по которой следует найти реестр выплат самозанятым
//  Сумма - Число - Сумма, на которую нужно найти реестр выплат самозанятым
//  Организация - Справочники.Организации - Организация, по которой следует найти реестр выплат самозанятым
//  ДатаДокумента - Дата - Дата документа оплаты
//
// Возвращаемое значение:
//  ТаблицаЗначений -таблица с реестрами, которые найдены по самозанятому.
//
Функция РеестрыВыплатПоСамозанятому(Самозанятый, Сумма, Организация, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Самозанятый", Самозанятый);
	Запрос.УстановитьПараметр("Сумма", Сумма);
	Если НачалоДня(ДатаДокумента) = ДатаДокумента Тогда
		Запрос.УстановитьПараметр("Период", КонецДня(ДатаДокумента));
	Иначе
		Запрос.УстановитьПараметр("Период", Новый Граница(ДатаДокумента, ВидГраницы.Исключая));
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадолженностьСамозанятыхПоРееструОстатки.Документ КАК РеестрВыплат,
	|	ЗадолженностьСамозанятыхПоРееструОстатки.Документ.Номер КАК Номер,
	|	ЗадолженностьСамозанятыхПоРееструОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.РасчетыСПрочимиКонтрагентами.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Контрагент = &Самозанятый) КАК ЗадолженностьСамозанятыхПоРееструОстатки
	|ГДЕ
	|	ЗадолженностьСамозанятыхПоРееструОстатки.СуммаОстаток <= &Сумма
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗадолженностьСамозанятыхПоРееструОстатки.Документ";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Возвращает банковский счет самозанятого из документа
//
// Параметры:
//  Документ    - Документы.ВыплатыСамозанятым - Ссылка на документ, из которого следует получить счет самозанятого
//  Самозанятый - Справочники.Контрагенты - самозанятый, чей банковский счет нужно вернуть
//
// Возвращаемое значение:
//  Справочники.БанковскиеСчета - банковский счет самозанятого
//
Функция БанковскийСчетСамозанятого(Документ, Самозанятый) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",     Документ);
	Запрос.УстановитьПараметр("Контрагент", Самозанятый);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВыплатыСамозанятымВыплаты.БанковскийСчет КАК БанковскийСчет
	|ИЗ
	|	Документ.ВыплатыСамозанятым.Выплаты КАК ВыплатыСамозанятымВыплаты
	|ГДЕ
	|	ВыплатыСамозанятымВыплаты.Ссылка = &Ссылка
	|	И ВыплатыСамозанятымВыплаты.Контрагент = &Контрагент";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.БанковскийСчет;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет у всех ли самозанятых заполнен ИНН
//
// Параметры:
//  Документ    - Документы.ВыплатыСамозанятым - Ссылка на документ, из которого следует получить счет самозанятого
//
// Возвращаемое значение:
//  Булево - у всех самозанятых заполнен ИНН
//
Функция УВсехСамозанятыхЗаполненИНН(Документ) Экспорт
	
	Отказ = Ложь;
	// Проверим у всех ли самозанятых заполнен ИНН (проверка на пустой ИНН или длину не равную 12 знакам)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыплатыСамозанятымВыплаты.НомерСтроки КАК НомерСтроки,
	               |	ВыплатыСамозанятымВыплаты.Контрагент.ИНН КАК ИНН
	               |ИЗ
	               |	Документ.ВыплатыСамозанятым.Выплаты КАК ВыплатыСамозанятымВыплаты
	               |ГДЕ
	               |	ВыплатыСамозанятымВыплаты.Ссылка.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СтрДлина(Выборка.ИНН) <> 12
			ИЛИ НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Выборка.ИНН) Тогда				
				Префикс = "Выплаты[%1].";
				Префикс = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					Префикс, 
					Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ="));
				Поле = Префикс + "Контрагент";
				ИмяСписка = НСтр("ru = 'Выплаты'");
				ТекстСообщенияРасшифровка = НСтр("ru = 'У самозанятого не указан ИНН. Заполните ИНН в карточке самозанятого.'");
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Колонка",
					"Корректность", 
					НСтр("ru = 'Самозанятый'"),
					Выборка.НомерСтроки, 
					ИмяСписка, 
					ТекстСообщенияРасшифровка);				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения, 
					Документ, 
					Поле, 
					"Объект", 
					Отказ);				
		КонецЕсли;
	КонецЦикла;
	
	Возврат НЕ Отказ;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьСостояние(СсылкаНаОбъект, Организация, СостояниеДокумента)
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьРегистра = РегистрыСведений.СтатусыДокументов.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Документ		= СсылкаНаОбъект;
	ЗаписьРегистра.Статус		= СостояниеДокумента;
	ЗаписьРегистра.Записать();
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

Функция СтатусРеестрВыплатОтменен() Экспорт
	
	Возврат "РеестрВыплатОтменен";
	
КонецФункции

Функция СтатусНеВсеЧекиЗагружены() Экспорт
	
	Возврат "НеВсеЧекиЗагружены";
	
КонецФункции

Функция СтатусЧекиНеПрикреплены() Экспорт
	
	Возврат "ЧекиНеПрикреплены";
	
КонецФункции 

Функция СтатусЧекиЗагружены() Экспорт
	
	Возврат "ЧекиЗагружены";
	
КонецФункции

Функция СтатусЗагрузкиЧековПриведенный(СтатусЗагрузкиЧеков) Экспорт
	
	Если СтатусЗагрузкиЧеков = "ЧекиЗагружены" Тогда
		Возврат Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЗагружены;
	ИначеЕсли СтатусЗагрузкиЧеков = "НеВсеЧекиЗагружены" ИЛИ СтатусЗагрузкиЧеков = "ЧекиНеПрикреплены" Тогда
		Возврат Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЧастичноЗагружены;
	Иначе
		Возврат Перечисления.СтатусыДокументовВыплатыСамозанятым.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВыплатыСамозанятым, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВыплатыСамозанятымВыплаты.НомерСтроки КАК НомерСтроки,
	|	ВыплатыСамозанятымВыплаты.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ВыплатыСамозанятымВыплаты.Ссылка.УслугаВТаблице
	|			ТОГДА ВыплатыСамозанятымВыплаты.Номенклатура.СчетУчетаЗатрат
	|		ИНАЧЕ ВыплатыСамозанятымВыплаты.Ссылка.Номенклатура.СчетУчетаЗатрат
	|	КОНЕЦ КАК СчетУчета,
	|	ВыплатыСамозанятымВыплаты.Ссылка.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВыплатыСамозанятымВыплаты.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВыплатыСамозанятымВыплаты.Ссылка.Проект КАК Проект,
	|	ВыплатыСамозанятымВыплаты.ЗаказПокупателя КАК ЗаказПокупателя,
	|	0 КАК СуммаДоходов,
	|	ВЫРАЗИТЬ(ВыплатыСамозанятымВыплаты.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютРасчетов.Кратность * КурсыВалютУчета.Курс) КАК ЧИСЛО(15, 2)) КАК СуммаРасходов,
	|	&ВыплатыСамозанятым КАК СодержаниеПроводки
	|ИЗ
	|	Документ.ВыплатыСамозанятым.Выплаты КАК ВыплатыСамозанятымВыплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО ВыплатыСамозанятымВыплаты.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|ГДЕ
	|	ВыплатыСамозанятымВыплаты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыплатыСамозанятымВыплаты.НомерСтроки КАК НомерСтроки,
	|	ВыплатыСамозанятымВыплаты.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ВыплатыСамозанятымВыплаты.Ссылка.УслугаВТаблице
	|			ТОГДА ВыплатыСамозанятымВыплаты.Номенклатура.СчетУчетаЗатрат
	|		ИНАЧЕ ВыплатыСамозанятымВыплаты.Ссылка.Номенклатура.СчетУчетаЗатрат
	|	КОНЕЦ КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	0 КАК СуммаВалДт,
	|	ВыплатыСамозанятымВыплаты.Ссылка.Корреспонденция КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	0 КАК СуммаВалКт,
	|	ВЫРАЗИТЬ(ВыплатыСамозанятымВыплаты.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютРасчетов.Кратность * КурсыВалютУчета.Курс) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	&ПрочееОприходование КАК Содержание
	|ИЗ
	|	Документ.ВыплатыСамозанятым.Выплаты КАК ВыплатыСамозанятымВыплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО ВыплатыСамозанятымВыплаты.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|ГДЕ
	|	ВыплатыСамозанятымВыплаты.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВыплатыСамозанятым);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("МоментВремени",
		Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("ВыплатыСамозанятым", НСтр("ru = 'Отражение затрат'"));
	Запрос.УстановитьПараметр("ПоступлениеДоходов", НСтр("ru = 'Прочие доходы'"));
	Запрос.УстановитьПараметр("ПрочееОприходование", НСтр("ru = 'Прочих затраты (расходы)'"));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", МассивРезультатов[0].Выгрузить());
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", МассивРезультатов[1].Выгрузить());
	
	// Прочие расчеты
	СформироватьТаблицаРасчетыСПрочимиКонтрагентами(ДокументСсылкаВыплатыСамозанятым, СтруктураДополнительныеСвойства);
	// Конец Прочие расчеты
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область ЗагрузкаДанныхВТабличнуюЧасть

// Позволяет досопоставить вручную колонки загружаемого файла и колонки табличной части, если они не были сопоставлены автоматически.
// Используется при пакетной загрузке данных.
//
// Параметры:
//  ЗагружаемыеДанные - ТаблицаЗначений - Загружаемые данные из файла.
//  СоответствиеКолонок - Соответствие - Новое соответствие колонок загружаемого файла и колонок табличной части.
//
Процедура СопоставитьКолонкиДанныхИзФайла(ЗагружаемыеДанные, СоответствиеКолонок) Экспорт
	
	// Ключевой колонкой, позволяющей загружать данные, является колонка "Ссылка на чек".
	// Если она не была явно указана в загружаемом файле, пробуем сопоставить ее по содержимому загружаемых данных.
	
	Если ЗагружаемыеДанные.Колонки.Найти("СсылкаНаЧек") <> Неопределено Тогда
		// Колонка "СсылкаНаЧек" уже есть в загружаемых данных. Сопоставление не требуется.
		Возврат;
	КонецЕсли;
	
	ЧислоСтрок = ?(ЗагружаемыеДанные.Количество() > 5, 5, ЗагружаемыеДанные.Количество()); // первых 5-ти строк будет достаточно для анализа
	
	Для НомерСтроки = 0 По ЧислоСтрок - 1 Цикл
		
		СтрокаДанных = ЗагружаемыеДанные[НомерСтроки];
		
		Для Каждого Колонка Из ЗагружаемыеДанные.Колонки Цикл
			
			Если Не СодержитСсылкуНаЧек(СтрокаДанных[Колонка.Имя]) Тогда
				Продолжить;
			КонецЕсли;
			
			СоответствиеКолонок.Вставить(Колонка.Имя, "СсылкаНаЧек");
			Возврат;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Сопоставляет построчно содержимое загружаемого файла и содержимое табличной части, в которую происходит загрузка.
// Пакетная загрузка данных с построчным сопоставлением.
//
// Параметры:
//  ЗагружаемыеДанные - ТаблицаЗначений - Загружаемые данные из файла.
//  Параметры - Структура - Параметры прикладной загрузки (см. ЗагрузкаДанныхИзВнешнихФайловКлиент.НовыйПараметрыПрикладнойЗагрузки()).
//  ТекстОшибки - Строка - Текст ошибки пользователю в случае, когда невозможно выполнить сопоставление данных.
//
Процедура СопоставитьЗагружаемыеДанныеПострочно(ЗагружаемыеДанные, Параметры, ТекстОшибки) Экспорт
	
	Если ЗагружаемыеДанные.Колонки.Найти("СсылкаНаЧек") = Неопределено Тогда
		
		ТекстОшибки = НСтр("ru = 'Не удалось найти колонку со ссылкой на чек. Данные не могут быть загружены.'");
		Возврат;
	КонецЕсли;
	
	Документ = Параметры.ОбъектДляЗагрузки;
	
	ДанныеИзФайла = ЗагружаемыеДанные.Скопировать();
	// Дополним колонки для сбора данных
	ДанныеИзФайла.Колонки.Добавить("ИНН", ОбщегоНазначения.ОписаниеТипаСтрока(12));
	ДанныеИзФайла.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ДанныеИзФайла.Колонки.Добавить("ПолноеНаименование", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ДанныеИзФайла.Колонки.Добавить("СтрокаОбработана", Новый ОписаниеТипов("Булево"));
	
	// Сумма может быть не загружена, но в дальнейшем мы можем по ней искать строку.
	СуммаЗагружена = ДанныеИзФайла.Колонки.Найти("Сумма") <> Неопределено;
	
	ЕстьКолонкаИмя = ДанныеИзФайла.Колонки.Найти("Имя") <> Неопределено;
	ЕстьКолонкаФамилия = ДанныеИзФайла.Колонки.Найти("Фамилия") <> Неопределено;
	ЕстьКолонкаОтчество = ДанныеИзФайла.Колонки.Найти("Отчество") <> Неопределено;
	ЕстьКолонкаФИО = ДанныеИзФайла.Колонки.Найти("ФИО") <> Неопределено;
	
	Для Каждого СтрокаДанных Из ДанныеИзФайла Цикл
		
		// ИНН
		ЧастьСсылкиНаЧек = СтрЗаменить(СтрокаДанных.СсылкаНаЧек, ВыплатыСамозанятымВызовСервераПовтИсп.АдресСервисаФНС(), "");
		МассивЧастейСсылки = СтрРазделить(ЧастьСсылкиНаЧек, "/");
		СтрокаДанных.ИНН = ВыплатыСамозанятым.ИННИзСсылкиНаЧек(МассивЧастейСсылки);
		
		// Полное наименование контрагента
		Если ЕстьКолонкаФИО Тогда
			СтрокаДанных.ПолноеНаименование = СокрЛП(СтрокаДанных.ФИО);
		Иначе
			МассивЧастейНаименования = Новый Массив;
			Если ЕстьКолонкаФамилия Тогда
				МассивЧастейНаименования.Добавить(СтрокаДанных.Фамилия);
			КонецЕсли;
			Если ЕстьКолонкаИмя Тогда
				МассивЧастейНаименования.Добавить(СтрокаДанных.Имя);
			КонецЕсли;
			Если ЕстьКолонкаОтчество Тогда
				МассивЧастейНаименования.Добавить(СтрокаДанных.Отчество);
			КонецЕсли;
			СтрокаДанных.ПолноеНаименование = СтрСоединить(МассивЧастейНаименования, " ");
		КонецЕсли;

		// Сумма платежа
		Если СуммаЗагружена И СтрокаДанных.Сумма = 0 Тогда
			СуммаЗагружена = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// Ограничим выбор только теми, что есть в исходном документе
	ИсходныйМассивКонтрагентов = Документ.Выплаты.ВыгрузитьКолонку("Контрагент");
	ВыплатыСамозанятым.ОпределитьКонтрагентовПоДаннымФайла(ДанныеИзФайла, ИсходныйМассивКонтрагентов);
	
	Для Каждого СтрокаВыплаты Из Документ.Выплаты Цикл
		Отбор = Новый Структура;
		
		Отбор.Вставить("СтрокаОбработана", Ложь);
		Отбор.Вставить("Контрагент", СтрокаВыплаты.Контрагент);
		Если СуммаЗагружена Тогда
			Отбор.Вставить("Сумма", СтрокаВыплаты.Сумма);
		КонецЕсли;
		СтрокиДанных = ДанныеИзФайла.НайтиСтроки(Отбор);
		Если СтрокиДанных.Количество() = 0 Тогда
			// Нет данных по этой строке
			Продолжить;
		КонецЕсли;
		СтрокаДанных = СтрокиДанных[0];
		СтрокаДанных.СтрокаОбработана = Истина;
		Если Не ЗначениеЗаполнено(СтрокаДанных.Контрагент) Тогда
			// Контрагент не найден
			Продолжить;
		КонецЕсли;
		
		ЗагружаемыеДанные[СтрокаДанных.НомерСтроки].НомерСтрокиТабличнойЧасти = СтрокаВыплаты.НомерСтроки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СодержитСсылкуНаЧек(Строка)
	
	АдресСервиса = ВыплатыСамозанятымВызовСервераПовтИсп.АдресСервисаФНС();
	
	Если СтрНайти(НРег(Строка), АдресСервиса) > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПрочимиКонтрагентами(ДокументСсылкаВыплатыСамозанятым, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("УчетРасчетовПоПрочимОперациям", НСтр("ru='Учет расчетов по прочим операциям'"));
	Запрос.УстановитьПараметр("КомментарийПриход", НСтр("ru='Увеличение долга контрагента'"));
	Запрос.УстановитьПараметр("КомментарийРасход", НСтр("ru='Уменьшение долга контрагента'"));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВыплатыСамозанятым);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ru='Курсовая разница'"));
	
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыплатыСамозанятымВыплаты.Ссылка КАК Документ,
	|	ВыплатыСамозанятымВыплаты.НомерСтроки КАК НомерСтроки,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВыплатыСамозанятымВыплаты.Контрагент КАК Контрагент,
	|	ВыплатыСамозанятымВыплаты.Договор КАК Договор,
	|	ВыплатыСамозанятымВыплаты.Договор.ВалютаРасчетов КАК Валюта,
	|	ВЫБОР
	|		КОГДА ВыплатыСамозанятымВыплаты.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА ВыплатыСамозанятымВыплаты.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ВыплатыСамозанятымВыплаты.Ссылка.Дата КАК Период,
	|	СУММА(ВЫРАЗИТЬ(ВыплатыСамозанятымВыплаты.Сумма * КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность / (КурсыВалютРасчетов.Кратность * КурсыВалютУчета.Курс) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	&УчетРасчетовПоПрочимОперациям КАК СодержаниеПроводки,
	|	&КомментарийРасход КАК Комментарий,
	|	ВыплатыСамозанятымВыплаты.Ссылка.Корреспонденция КАК СчетУчета,
	|	СУММА(ВыплатыСамозанятымВыплаты.Сумма) КАК СуммаВал,
	|	ВыплатыСамозанятымВыплаты.Ссылка.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ВыплатыСамозанятым.Выплаты КАК ВыплатыСамозанятымВыплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО ВыплатыСамозанятымВыплаты.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|ГДЕ
	|	ВыплатыСамозанятымВыплаты.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыплатыСамозанятымВыплаты.Ссылка,
	|	ВыплатыСамозанятымВыплаты.НомерСтроки,
	|	ВыплатыСамозанятымВыплаты.Контрагент,
	|	ВыплатыСамозанятымВыплаты.Договор,
	|	ВыплатыСамозанятымВыплаты.Договор.ВалютаРасчетов,
	|	ВыплатыСамозанятымВыплаты.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА ВыплатыСамозанятымВыплаты.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА ВыплатыСамозанятымВыплаты.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВыплатыСамозанятымВыплаты.Ссылка.Корреспонденция";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПрочимиКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПокупателями()

#Область СтандартныеПодсистемы_УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
 
 Ограничение.Текст =
 "РазрешитьЧтениеИзменение
 |ГДЕ
 | ЗначениеРазрешено(Организация)";
 
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Реестр выплат самозанятым
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрВыплатСамозанятым";
	КомандаПечати.Представление = НСтр("ru = 'Реестр выплат самозанятым'");
	КомандаПечати.Порядок       = 1;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр),
//                                            см. УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм.
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект,
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрВыплатСамозанятым") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"РеестрВыплатСамозанятым",
			НСтр("ru = 'Реестр выплат самозанятым'"),
			ПечатьРеестрВыплатСамозанятым(МассивОбъектов, ОбъектыПечати),
			, // пиктограмма печатной формы отсутствует
			"Документ.ВыплатыСамозанятым.ПФ_MXL_РеестрВыплатСамозанятым");
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьРеестрВыплатСамозанятым(Ссылки, ОбъектыПечати)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыплатыСамозанятым.Организация КАК Организация,
	|	ВыплатыСамозанятым.Организация.НаименованиеСокращенное КАК ОрганизацияПредставление,
	|	ВыплатыСамозанятым.Автор.ФизическоеЛицо КАК ОтветственныйФизическоеЛицо,
	|	ВыплатыСамозанятым.Номер КАК Номер,
	|	ВыплатыСамозанятым.Дата КАК Дата,
	|	ВыплатыСамозанятым.Ссылка КАК Ссылка,
	|	ВыплатыСамозанятым.Номенклатура КАК Номенклатура,
	|	ВыплатыСамозанятым.УслугаВТаблице КАК УслугаВТаблице,
	|	ВыплатыСамозанятым.СуммаДокумента КАК Всего,
	|	ВыплатыСамозанятым.Выплаты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Контрагент КАК Контрагент,
	|		БанковскийСчет КАК БанковскийСчет,
	|		Сумма КАК Сумма,
	|		Содержание КАК Содержание,
	|		НомерЧека КАК НомерЧека,
	|		ПричинаОтказа КАК ПричинаОтказа,
	|		РасшифровкаРезультата КАК РасшифровкаРезультата
	|	) КАК Выплаты
	|ИЗ
	|	Документ.ВыплатыСамозанятым КАК ВыплатыСамозанятым
	|ГДЕ
	|	ВыплатыСамозанятым.Ссылка В(&Ссылки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыплатыСамозанятым.Ссылка,
	|	ВыплатыСамозанятым.Дата,
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
	Результат = Новый ТабличныйДокумент;
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Результат.КлючПараметровПечати = "Документ.ВыплатыСамозанятым.ПФ_MXL_РеестрВыплатСамозанятым";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыплатыСамозанятым.ПФ_MXL_РеестрВыплатСамозанятым");
	
	ОбластиМакета = Новый Структура("Шапка, ШапкаТаблицы, Строка, КонецТаблицы, Подпись");
	Для Каждого ОписаниеОбласти Из ОбластиМакета Цикл
		ОбластиМакета[ОписаниеОбласти.Ключ] = Макет.ПолучитьОбласть(ОписаниеОбласти.Ключ);
	КонецЦикла;
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			Результат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НачалоОбластиПечати = Результат.ВысотаТаблицы + 1;
		
		// Начало документа
		ОбластиМакета.Шапка.Параметры.Заполнить(ВыборкаДокумент);
		ФорматированныеПараметры = Новый Структура;
		ФорматированныеПараметры.Вставить("ДатаДокумента", НРег(Формат(ВыборкаДокумент.Дата, "ДЛФ=D")));
		ФорматированныеПараметры.Вставить("НомерДокумента", 
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаДокумент.Номер, Истина, Истина));
		ОбластиМакета.Шапка.Параметры.Заполнить(ФорматированныеПараметры);
		Результат.Вывести(ОбластиМакета.Шапка);
		
		// Шапка таблицы
		Результат.Вывести(ОбластиМакета.ШапкаТаблицы);
		
		ИнформацияОСодержании = Новый Структура;
		УслугаВТаблице = ВыборкаДокумент.УслугаВТаблице;
		Если Не УслугаВТаблице Тогда
			ПараметрыОбъекта = Новый Структура;
			ПараметрыОбъекта.Вставить("Дата", ВыборкаДокумент.Дата);
			ПараметрыОбъекта.Вставить("Организация", ВыборкаДокумент.Организация);
			
			НаименованиеПолное = ОбщегоНазначения.ЗначениеРеквизитаОбъекта( ВыборкаДокумент.Номенклатура, "НаименованиеПолное");
			ИнформацияОСодержании.Вставить("Содержание", НаименованиеПолное);
		КонецЕсли;
		
		// Строки таблицы
		ВыборкаСтрок = ВыборкаДокумент.Выплаты.Выбрать();
		Пока ВыборкаСтрок.Следующий() Цикл
			
			// В основном сценарии предполагаем, что чеки для самозанятых успешно созданы и заполняем макет из запроса напрямую
			ОбластиМакета.Строка.Параметры.Заполнить(ВыборкаСтрок);
			// В тех случаях, когда банк вернет ошибку по чекам самозанятых, нужно в печатную форму вписать ошибку,
			// возвращенную банком. Т.к. чек не будет сформирован.
			ИнформацияОЧеке = Новый Структура("НомерЧека");
			Если ЗначениеЗаполнено(ВыборкаСтрок.ПричинаОтказа) Тогда
				ИнформацияОЧеке.НомерЧека = ВыборкаСтрок.РасшифровкаРезультата;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаСтрок.НомерЧека) Тогда
				ИнформацияОЧеке.НомерЧека = СтрШаблон("№ %1", ВыборкаСтрок.НомерЧека);
			КонецЕсли;
			Если ЗначениеЗаполнено(ИнформацияОЧеке.НомерЧека) Тогда
				ОбластиМакета.Строка.Параметры.Заполнить(ИнформацияОЧеке);
			КонецЕсли;
			
			Если Не УслугаВТаблице Тогда
				ОбластиМакета.Строка.Параметры.Заполнить(ИнформацияОСодержании);
			КонецЕсли;
			СведенияОКонтрагенте = ПечатьДокументовУНФ.СведенияОЮрФизЛице(
				ВыборкаСтрок.Контрагент,
				ВыборкаДокумент.Дата,
				,
				ВыборкаСтрок.БанковскийСчет);
			ОбластиМакета.Строка.Параметры.Заполнить(СведенияОКонтрагенте);
			Результат.Вывести(ОбластиМакета.Строка);
		КонецЦикла;
		
		// Конец таблицы
		ОбластиМакета.КонецТаблицы.Параметры.Заполнить(ВыборкаДокумент);
		Результат.Вывести(ОбластиМакета.КонецТаблицы);
		
		// Подписи
				
		СведенияПодписи = Новый Структура;
		СведенияПодписи.Вставить("ДолжностьПодписавшегоЛица", "-----------------");
		СведенияПодписи.Вставить("ДокументПодписал", "-----------------");
		ОбластиМакета.Подпись.Параметры.Заполнить(СведенияПодписи);
		
		Результат.Вывести(ОбластиМакета.Подпись);
		
		// В табличном документе зададим имя области, в которую был выведен объект.
		// Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			Результат,
			НачалоОбластиПечати,
			ОбъектыПечати,
			ВыборкаДокумент.Ссылка);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
